app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    debugger
    @all_ratings = ['G', 'PG', 'PG-13', 'R']

    @order = params[:order]

    if params[:ratings]
      @ratings_hash = params[:ratings]
    end

    if params[:ratings]
      @ratings_allowed = params[:ratings].keys
    end

    @movies = Movie.where('rating' => @ratings_allowed).find(:all, :order => @order)